''Задание
Уменьшите размер ядер свёрточных слоёв, сделав их 3x3. 
Как изменился результат обучения в плане точности и скорости? Примечание: не забудьте поменять другие параметры в модели, иначе обучение не начнётся.
Измените модель, сделав её такой: свёрточный слой, слой нормализации, слой ReLU, слой max-pooling, свёрточный слой, слой нормализации, слой ReLU, линейный слой.
Как изменился результат обучения в плане точности и скорости? Примечание: не забудьте поменять другие параметры в модели, иначе обучение не начнётся.
Используя тестовый набор изображений, вытащите из него 20 картинок (а не 10, как в уроке).
Выведите все 20 изображений на экран, а в консоль выведите правильные ответы и прогноз нейросети.
Рассчитайте точность прогноза в процентах на основе 20 изображений из предыдущего задания 
(например, если угадано 15 изображений из 20, то точность равна 75%). Выведите получившуюся точность в консоль.''
